package varconsttypes

import "fmt"

func VarConstTypes() {

	fmt.Println("1.1 Переменные, константы и типы данных-------------------------------------------------")

	age := 3
	name := "Jonhy"
	isStudent := false
	fmt.Printf("Hi, my name is %s, i'm %d years old. Am I student? %t\n", name, age, isStudent)

	const DaysInWeek = 7
	// DaysInWeek = 8
	// 1. cannot assign to DaysInWeek (нельзя присвоить значение для DaysInWeek). Они создаются один раз во время компиляции, и их значение «вжигается» в бинарный файл. Изменить его во время работы программы физически невозможно.
	// 2. (neither addressable nor a map index expression) (значение не является ни адресуемым, ни выражением индекса карты). Компилятор Go пытается подсказать, почему это невозможно с точки зрения архитектуры памяти.
	// • Переменные имеют свой адрес в оперативной памяти (RAM), куда можно пойти и записать новые байты.
	// • Константы в Go не имеют адреса в памяти (к ним нельзя применить оператор взятия адреса &). Они существуют только как абстрактные значения на этапе сборки кода. Раз адреса в памяти нет — процессору буквально некуда записывать цифру 8.

	// Строгая статическая типизация: тип переменной известен при компиляции и не может меняться на лету.
	a := 10
	b := 5.5
	result := float64(a) + b // Приведение типов явное, автоматического приведения типов в Go нет.
	fmt.Printf("Sum of a (%d) and b (%0.1f) = (%0.1f)\n", a, b, result)

	// Целые числа: int (зависит от платформы, 32 или 64 бита), int8, int16, int32, int64. Беззнаковые аналоги: uint, uint8...
	// Числа с плавающей точкой: float32, float64.
	var (
		defInt  int
		defF64  float64
		defStr  string
		defBool bool
	)
	fmt.Println("(Default) Zero values:\nint =", defInt, "; float64 =", defF64, "; string =", defStr, "; bool =", defBool)
}
