package packages

import (
	"fmt"
	"go-roadmap/Step-1/packages/mathutils" // локальный пакет (go-roadmap — имя из go.mod)
	// "math/rand" // Вложенный стандартный пакет
)

func Packages() {

	fmt.Println("Базовая работа с пакетами------------------------------------------")
	/*
		Пакеты помогают организовывать код в изолированные модули и управлять областью видимости.

		Компилятор ищет пакет main и функцию main() внутри: это точка входа, из этого кода собрать исполняемый бинарный файл. Код в других пакетах (package math) компилируется в библиотеки, которые нельзя запустить сами по себе.

		2. Область видимости в пакете
		В рамках пакета (даже если код разнесен по 10 файлам в одной папке) функции, структуры и переменные видны без импортов.

		• func Calculate() — экспортируемая. импортировать и вызвать в других пакетах  имя_пакета.Calculate().
		• func calculate() — неэкспортируемая. Доступна только внутри пакета.

		3. Система модулей (go mod)
		Управлять зависимостями и импортировать собственные локальные пакеты.

		Если импортировал пакет, но не используешь его, компилятор ошибку. Go за чистоту и не позволяет тащить мертвый код.


		module go-roadmap в go.mod?
		module go-roadmap — объявление имени модуля (корневого пути проекта).
		Компилятор Go использует это имя как базовый префикс для импорта внутренних пакетов проекта.
		пакет mathutils лежал в папке algebra, в main.go  импортировал его по полному пути относительно корня модуля:
		import "go-roadmap/algebra"

		go.mod превращает папку на диске в изолированный Go-модуль, позволяя рантайму управлять зависимостями и связывать файлы при сборке.
	*/

	fmt.Println(mathutils.Add(2, 3))
	// fmt.Println(mathutils.secretSubtract(4, 5)) // undefined: mathutils.secretSubtract  рантайм защищает приватные функции пакета от внешнего доступа
}
