package roadmap

import "fmt"

// • Задача 1. Объявление переменных. Объяви три переменные: age (тип int), name (тип string) и isStudent (тип bool). Присвой им любые значения, используя краткую форму объявления (:=), и выведи их на экран с помощью fmt.Println().
// • Задача 2. Явное указание типа. Создай переменную price типа float64 с помощью ключевого слова var без инициализации (без знака =). Выведи её значение. Какое число ты увидел и почему?
// • Задача 3. Константы. Создай константу DaysInWeek со значением 7. Попробуй в следующей строке кода изменить её значение на 8. Какую ошибку выдаст компилятор? (Зафиксируй ошибку в комментарии).
// • Задача 4. Преобразование типов. Создай две переменные: a типа int со значением 10 и b типа float64 со значением 5.5. Посчитай их сумму, приведя a к типу float64. Результат запиши в переменную result и выведи на экран.
// • Задача 5. Нулевые значения. Объяви четыре переменные разных типов (int, float64, string, bool), используя var без присвоения значений. Выведи их все в одной строке через fmt.Println(), чтобы увидеть их дефолтные значения (zero values).

func main() {
	fmt.Printf("Hello")
}
